{
  "experience": [
    {
      "role": "Senior Frontend Developer",
      "company": "Evolution",
      "country": "Latvia",
      "dateStart": "15 July 2024",
      "dateEnd": "",
      "stack": "React, TypeScript, MobX, Canvas, PixiJS, Jest",
      "description": {
        "common": "Evolution is a leading global provider of B2B services for online casinos, partnering with top operators worldwide. The company develops innovative gaming products and platforms, including live casinos, game shows, and slots, delivering the highest quality user experience for players.\nMy area of responsibility:",
        "achievements": [
          "Create games from the scratch, based on React+Canvas;",
          "Fix issues and bugs in existing games;"
        ]
      }
    },
    {
      "role": "Senior Frontend Engineer",
      "company": "T.I.N.T.",
      "country": "Latvia",
      "dateStart": "1 November 2023",
      "dateEnd": "21 March 2024",
      "stack": "React, TypeScript, Tailwind, Zustand, GraphQL, Apollo Client, WebSockets, ProseMirror, Universal router, Nest, Vite",
      "description": {
        "common": "TINT is personalized assistant based on AI, with your personal context. The product had not yet been publicly released when I left the company.\nMy area of responsibility:",
        "achievements": [
          "Building frontend architecture from scratch;",
          "Selecting technologies and specific libraries;",
          "Implementing a full-fledged text editor (based onProseMirror);"
        ]
      }
    },
    {
      "role": "Senior Frontend Engineer",
      "company": "Juro",
      "country": "Latvia",
      "dateStart": "16 February 2020",
      "dateEnd": "17 October 2023",
      "stack": "React, TypeScript, MobX, WebSockets, Playwright, Jest, ProseMirror, Node.js",
      "description": {
        "common": "Juro is a London-based startup funded by venture capital firms such as Eight Roads, Union Square Ventures, Point Nine Capital, Seedcamp, and Taavet Hinrikus.\nThe most interesting challenges as Senior Frontend Engineer:",
        "responsibilities": [
          "Refactoring legacy code (replacing the UI-Router (Angular) with React-Router v6). Developed a transition plan and its implementation;",
          "Led a development team of 5 people;",
          "Participated in the hiring process for engineers, conducted technical interviews;",
          "Implemented self-service payment systems with interface restrictions for different plans;",
          "Performance optimization, including the use of profilers and developer tools;",
          "Prepared and conducted a workshop for colleagues on effective work with React + MobX;",
          "Mentored less experienced colleagues;"
        ],
        "common2": "The most interesting challenges as Frontend Engineer:",
        "achievements": [
          "Implemented and started using E2E tests (Playwright);",
          "Improved performance through optimization of work with MobX;",
          "Standardized the codebase through automation of usage ESLint and Prettier;",
          "Implemented a toolkit for easy addition and updating of tours in the application;"
        ]
      }
    },
    {
      "role": "Frontend Engineer",
      "company": "AEON",
      "country": "Russia",
      "dateStart": "02 December 2018",
      "dateEnd": "15 January 2020",
      "stack": "React, Redux, WebSockets, GraphQL, Apollo Client, React Native",
      "description": {
        "common": "Participated in the development of a big and complicated project (startup). Company's main product was e-document management system: catalogue with complicated filters, full-text editor, visualisation of logic on Canvas, great performance attention.\nMy area of responsibility was:",
        "responsibilities": [
          "Led the mobile development team;",
          "Hired people for the team;",
          "Created and delivered a JavaScript (FE) course (in terms of HR-activities);",
          "Development the main (web) and mobile (React Native) applications;"
        ],
        "common2": "The most interesting challenges:",
        "achievements": [
          "In-house implementation of i18n, pluralization and formatting of dates/currencies/numbers;",
          "System for page formatting (JSON-like structure which was being formatted in A3, A4, A5 pages with continue styles between pages). Required for text editor;"
        ]
      }
    },
    {
      "role": "Frontend Engineer",
      "company": "Iton Bous",
      "country": "Russia",
      "dateStart": "18 April 2018",
      "dateEnd": "29 November 2018",
      "stack": "React, Redux, Git, HTML, CSS",
      "description": {
        "common": "Developed a communication platform for manufacturers and small retailers, improving industry-wide collaboration.\nMy area of responsibility was:",
        "achievements": [
          "Led the selection of tools and technologies for project development;",
          "Translated mockups into user-friendly interfaces, ensuring seamless user experiences;",
          "Collaborated closely with backend developers and designers;"
        ]
      }
    },
    {
      "role": "Frontend Engineer",
      "company": "URSiP",
      "country": "Russia",
      "dateStart": "12 November 2017",
      "dateEnd": "10 April 2018",
      "stack": "React, Redux, HTML, SASS, Git",
      "description": {
        "common": "My area of responsibility was:",
        "achievements": [
          "Led the development of an automatisation system for a governmental institution;",
          "Responsible for selecting appropriate tools and technologies;",
          "Translated mockups and specifications provided by analysts into a user-friendly interface;",
          "Collaborated with backend developers to design and implement efficient APIs;",
          "Successfully delivered a fully functional product to the customer;"
        ]
      }
    },
    {
      "role": "Frontend Developer",
      "company": "amoCRM",
      "country": "Russia",
      "dateStart": "18 April 2017",
      "dateEnd": "6 November 2017",
      "stack": "Backbone, Git, HTML, CSS",
      "description": {
        "common": "Work in a big team. Main activities:",
        "achievements": [
          "Development interface from mockups",
          "Bugfix",
          "Building of new functionality"
        ]
      }
    }
  ]
}
